{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<BOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<EOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFKC"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<UNK>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<PAD>": 0,
      "<UNK>": 1,
      "<BOS>": 2,
      "<EOS>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "C": 36,
      "M": 37,
      "N": 38,
      "R": 39,
      "T": 40,
      "V": 41,
      "Z": 42,
      "[": 43,
      "\\": 44,
      "]": 45,
      "^": 46,
      "_": 47,
      "`": 48,
      "a": 49,
      "b": 50,
      "c": 51,
      "d": 52,
      "e": 53,
      "f": 54,
      "g": 55,
      "h": 56,
      "i": 57,
      "j": 58,
      "k": 59,
      "l": 60,
      "m": 61,
      "n": 62,
      "o": 63,
      "p": 64,
      "q": 65,
      "r": 66,
      "s": 67,
      "t": 68,
      "u": 69,
      "v": 70,
      "w": 71,
      "x": 72,
      "y": 73,
      "z": 74,
      "{": 75,
      "|": 76,
      "}": 77,
      "~": 78,
      "¡": 79,
      "¢": 80,
      "£": 81,
      "¤": 82,
      "¥": 83,
      "¦": 84,
      "§": 85,
      "¨": 86,
      "©": 87,
      "ª": 88,
      "«": 89,
      "¬": 90,
      "®": 91,
      "¯": 92,
      "°": 93,
      "±": 94,
      "²": 95,
      "³": 96,
      "´": 97,
      "µ": 98,
      "¶": 99,
      "·": 100,
      "¸": 101,
      "¹": 102,
      "º": 103,
      "»": 104,
      "¼": 105,
      "½": 106,
      "¾": 107,
      "¿": 108,
      "Â": 109,
      "Ã": 110,
      "Ä": 111,
      "Å": 112,
      "È": 113,
      "Ê": 114,
      "Ë": 115,
      "Ì": 116,
      "Î": 117,
      "Ï": 118,
      "Ð": 119,
      "Ñ": 120,
      "á": 121,
      "â": 122,
      "ã": 123,
      "ä": 124,
      "å": 125,
      "æ": 126,
      "ç": 127,
      "è": 128,
      "é": 129,
      "ê": 130,
      "ë": 131,
      "ì": 132,
      "ï": 133,
      "Ġ": 134,
      "Ģ": 135,
      "ģ": 136,
      "Ĥ": 137,
      "ĥ": 138,
      "Ħ": 139,
      "ħ": 140,
      "Ĩ": 141,
      "ĩ": 142,
      "Ī": 143,
      "ī": 144,
      "Ĭ": 145,
      "ĭ": 146,
      "Į": 147,
      "į": 148,
      "İ": 149,
      "ı": 150,
      "Ĳ": 151,
      "ĳ": 152,
      "Ĵ": 153,
      "ĵ": 154,
      "Ķ": 155,
      "ķ": 156,
      "ĸ": 157,
      "Ĺ": 158,
      "ĺ": 159,
      "Ļ": 160,
      "ļ": 161,
      "Ľ": 162,
      "ľ": 163,
      "Ŀ": 164,
      "ŀ": 165,
      "Ł": 166,
      "ł": 167,
      "Ń": 168,
      "Ġt": 169,
      "Ġth": 170,
      "Ġa": 171,
      "in": 172,
      "\\\\": 173,
      "Ġs": 174,
      "Ġthe": 175,
      "er": 176,
      "Ġ\\\\": 177,
      "on": 178,
      "Ġc": 179,
      "re": 180,
      "Ġi": 181,
      "at": 182,
      ".\\": 183,
      "le": 184,
      "Ġp": 185,
      "Ġb": 186,
      "Ġf": 187,
      "Ġo": 188,
      "en": 189,
      "Ġan": 190,
      "Ġ=": 191,
      "Ġm": 192,
      "Ġn": 193,
      "es": 194,
      "ĠĠ": 195,
      "or": 196,
      "al": 197,
      "Ġto": 198,
      "ion": 199,
      "an": 200,
      "Ġw": 201,
      "ing": 202,
      "it": 203,
      "Ġin": 204,
      "Ġd": 205,
      "ut": 206,
      "ed": 207,
      "ro": 208,
      "ac": 209,
      "Ġ\\\\(": 210,
      "Ġe": 211,
      "Ġand": 212,
      "Ġof": 213,
      "Ġ1": 214,
      "Ġis": 215,
      "is": 216,
      "Ġ+": 217,
      "Ġ-": 218,
      "th": 219,
      "ar": 220,
      "ou": 221,
      "ic": 222,
      "um": 223,
      "Ġre": 224,
      "ct": 225,
      "Ġ\\\\)": 226,
      "ve": 227,
      "Ġthat": 228,
      "Ġ2": 229,
      "ly": 230,
      "Ġh": 231,
      "st": 232,
      "se": 233,
      "id": 234,
      "Ġ(": 235,
      "ent": 236,
      "Ġfor": 237,
      "qu": 238,
      "ol": 239,
      "Ġcon": 240,
      "gh": 241,
      "Ġbe": 242,
      "im": 243,
      ":\\": 244,
      "Ġl": 245,
      "Ġse": 246,
      "\\'": 247,
      "ter": 248,
      "Ġg": 249,
      "om": 250,
      "Ġne": 251,
      "\\\\)": 252,
      "Ġwh": 253,
      "Ġst": 254,
      "ot": 255,
      "rac": 256,
      "Ġpo": 257,
      "ions": 258,
      "Ġcan": 259,
      "ir": 260,
      "ght": 261,
      "ss": 262,
      "ay": 263,
      "ĠĠĠĠ": 264,
      "Ġare": 265,
      "ow": 266,
      "ns": 267,
      "Ġon": 268,
      "ce": 269,
      "Ġu": 270,
      "Ġpro": 271,
      "ap": 272,
      "ri": 273,
      "Ġ3": 274,
      "Ġx": 275,
      "ith": 276,
      "ach": 277,
      "}{": 278,
      "ll": 279,
      "frac": 280,
      "Ġex": 281,
      "Ġv": 282,
      "ble": 283,
      "Ġ0": 284,
      "Ġit": 285,
      "Ġdi": 286,
      "Ġle": 287,
      "as": 288,
      "Ġneed": 289,
      "Ġwith": 290,
      "Ġthis": 291,
      "nth": 292,
      "ive": 293,
      "rom": 294,
      "ul": 295,
      "Ġy": 296,
      "00": 297,
      "Ġper": 298,
      "ber": 299,
      "ld": 300,
      "em": 301,
      "Ġk": 302,
      "Ġnum": 303,
      "am": 304,
      "Ġsu": 305,
      "Ġde": 306,
      "int": 307,
      "sid": 308,
      "Ġnumber": 309,
      "Ġr": 310,
      "be": 311,
      "Ġ4": 312,
      "ation": 313,
      "ang": 314,
      "Ġfin": 315,
      "olut": 316,
      "Ġme": 317,
      "ad": 318,
      "sider": 319,
      "Ġif": 320,
      "ist": 321,
      "ere": 322,
      "Ġat": 323,
      "Ġas": 324,
      "ould": 325,
      "nw": 326,
      "ch": 327,
      "Ġeach": 328,
      "ain": 329,
      "Ġfrom": 330,
      "ich": 331,
      "aps": 332,
      "Ġsh": 333,
      "nb": 334,
      "ate": 335,
      "nso": 336,
      "Ġconsider": 337,
      "ple": 338,
      "nt": 339,
      "put": 340,
      "**": 341,
      "te": 342,
      "if": 343,
      "haps": 344,
      "ĠĠĠ": 345,
      "Ġwhich": 346,
      "Ġso": 347,
      "pl": 348,
      "il": 349,
      "olution": 350,
      "ait": 351,
      "ur": 352,
      "nle": 353,
      "Ġsum": 354,
      "Ġch": 355,
      "ver": 356,
      "Ġor": 357,
      "nbut": 358,
      "Ġbut": 359,
      "]\\": 360,
      "de": 361,
      "Ġcom": 362,
      "ore": 363,
      "nlet": 364,
      "ction": 365,
      "Ġperhaps": 366,
      "nwait": 367,
      "ff": 368,
      "Ġnot": 369,
      "end": 370,
      "iv": 371,
      "Ġ<": 372,
      "--": 373,
      "Ġfind": 374,
      "Ġall": 375,
      "Ġ5": 376,
      "Ġby": 377,
      "Ġ\\\\),": 378,
      "et": 379,
      "Ġma": 380,
      "ep": 381,
      "ative": 382,
      "est": 383,
      "Ġequ": 384,
      "nal": 385,
      "ces": 386,
      "ought": 387,
      ")\\": 388,
      "Ġwe": 389,
      "of": 390,
      "Ġthere": 391,
      "pp": 392,
      "ations": 393,
      "sit": 394,
      "Ġab": 395,
      "us": 396,
      "Ġ'": 397,
      "^{": 398,
      "|>": 399,
      "iz": 400,
      "tern": 401,
      "ment": 402,
      "Ġco": 403,
      "'s": 404,
      "Ġtr": 405,
      "qr": 406,
      "ec": 407,
      "Ġshould": 408,
      "Ġpre": 409,
      "Ġform": 410,
      "Ġpoint": 411,
      "qrt": 412,
      "Ġro": 413,
      "nf": 414,
      "Ġstep": 415,
      "ssi": 416,
      "Ġ\"": 417,
      "ther": 418,
      "nn": 419,
      "Ġtw": 420,
      "Ġ6": 421,
      "pt": 422,
      "ave": 423,
      "ke": 424,
      "lo": 425,
      "aybe": 426,
      "ine": 427,
      "ue": 428,
      "ternative": 429,
      "Ġ$": 430,
      "Ġac": 431,
      "\\\\[": 432,
      "ink": 433,
      "ng": 434,
      "Ġâ": 435,
      "),": 436,
      "ase": 437,
      "nalternative": 438,
      "pre": 439,
      "_{": 440,
      "Ġone": 441,
      "ni": 442,
      "nalternatively": 443,
      "Ġtwo": 444,
      "ies": 445,
      "Ġsolution": 446,
      "ant": 447,
      "Ġthink": 448,
      "nd": 449,
      "irst": 450,
      "\\\\),": 451,
      "Ġqu": 452,
      "Ġhave": 453,
      "angle": 454,
      "right": 455,
      "Ġmo": 456,
      "cle": 457,
      "Ġthen": 458,
      "ge": 459,
      "Ġposit": 460,
      "ince": 461,
      "':": 462,
      "ect": 463,
      "gin": 464,
      "rou": 465,
      "ger": 466,
      "art": 467,
      "cess": 468,
      "Ġsp": 469,
      "per": 470,
      "con": 471,
      "Ġwhere": 472,
      "Ġal": 473,
      "sqrt": 474,
      "and": 475,
      "ome": 476,
      "oo": 477,
      "are": 478,
      "our": 479,
      "blem": 480,
      "Ġmin": 481,
      "ight": 482,
      "rect": 483,
      "out": 484,
      "Ġ*": 485,
      "Ġproblem": 486,
      "Ġ10": 487,
      "Ġmaybe": 488,
      "Ġno": 489,
      "Ġapp": 490,
      "iven": 491,
      "Ġtri": 492,
      "xt": 493,
      "fore": 494,
      "ample": 495,
      "Ġdiff": 496,
      "ft": 497,
      "ime": 498,
      "Ġ9": 499,
      "imes": 500,
      "Ġpl": 501,
      "act": 502,
      "thought": 503,
      "ence": 504,
      "ĠĠĠĠĠĠĠ": 505,
      "Ġany": 506,
      "Ġ{": 507,
      "ssible": 508,
      "Ġ[": 509,
      "Ġinte": 510,
      "Ġdiffer": 511,
      "cd": 512,
      "cl": 513,
      "ems": 514,
      "ally": 515,
      "Ġval": 516,
      "10": 517,
      "Ġbet": 518,
      "ity": 519,
      "Ġ**": 520,
      "Ġsuch": 521,
      "Ġlet": 522,
      "Ġacc": 523,
      "nthis": 524,
      "Ġ\\\\).\\": 525,
      "Ġsince": 526,
      "ated": 527,
      "ord": 528,
      "Ġhe": 529,
      "Ġcor": 530,
      "Ġinteger": 531,
      "Ġz": 532,
      "Ġsome": 533,
      "Ġway": 534,
      "Ġad": 535,
      "ure": 536,
      "nnow": 537,
      "Ġ7": 538,
      "ors": 539,
      "Ġpr": 540,
      "Ġdist": 541,
      "fin": 542,
      "Ġstr": 543,
      "ide": 544,
      "Ġver": 545,
      "os": 546,
      "Ġ8": 547,
      "Ġang": 548,
      "Ġ>": 549,
      "ult": 550,
      "Ġpa": 551,
      "Ġus": 552,
      "Ġtry": 553,
      "Ġbo": 554,
      "begin": 555,
      "Ġdiv": 556,
      "Ġseems": 557,
      "Ġangle": 558,
      "low": 559,
      "ust": 560,
      "Ġmax": 561,
      "erm": 562,
      "Ġtriangle": 563,
      "Ġint": 564,
      "Ġsub": 565,
      "ame": 566,
      "Ġappro": 567,
      "Ġhas": 568,
      "Ġpossible": 569,
      "tal": 570,
      "\\\\]\\": 571,
      "ta": 572,
      "Ġterm": 573,
      "Ġsy": 574,
      "ise": 575,
      ")^": 576,
      "Ġout": 577,
      "ag": 578,
      "Ġen": 579,
      "Ġ<|": 580,
      "Ġequal": 581,
      "Ġfirst": 582,
      "ree": 583,
      "Ġcir": 584,
      "all": 585,
      "Ġup": 586,
      "Ġj": 587,
      "Ġset": 588,
      "nin": 589,
      "un": 590,
      "Ġpoints": 591,
      "rough": 592,
      "Ġrem": 593,
      "Ġthrough": 594,
      "val": 595,
      "Ġcol": 596,
      "ack": 597,
      "Ġinter": 598,
      "Ġprocess": 599,
      "solution": 600,
      "Ġsim": 601,
      "Ġar": 602,
      "Ġthese": 603,
      "Ġsteps": 604,
      "Ġtotal": 605,
      "Ġdo": 606,
      "ial": 607,
      "Ġexpl": 608,
      "stem": 609,
      "press": 610,
      "Ġ\\'": 611,
      "ab": 612,
      "text": 613,
      "Ġapproach": 614,
      "pon": 615,
      "<|": 616,
      "we": 617,
      "ngth": 618,
      "ount": 619,
      "ath": 620,
      "uct": 621,
      ").\\": 622,
      "Ġthan": 623,
      "Ġexpress": 624,
      "Ġ/": 625,
      "Ġother": 626,
      "Ġquest": 627,
      "nthen": 628,
      "ween": 629,
      "Ġthought": 630,
      "ous": 631,
      "ast": 632,
      "Ġim": 633,
      "Ġbetween": 634,
      "Ġcase": 635,
      "cul": 636,
      "Ġres": 637,
      "ize": 638,
      "ilar": 639,
      "Ġ\\": 640,
      "Ġspec": 641,
      "Ġinto": 642,
      "Ġdifferent": 643,
      "urre": 644,
      "imum": 645,
      "Ġ\\\\(\\\\": 646,
      "Ġterms": 647,
      "Ġ\\\\]\\": 648,
      "ort": 649,
      "cdot": 650,
      "eck": 651,
      "times": 652,
      "git": 653,
      "Ġfol": 654,
      "ill": 655,
      "Ġfun": 656,
      "wer": 657,
      "cise": 658,
      "quare": 659,
      "Ġcorrect": 660,
      "11": 661,
      "Ġformat": 662,
      "Ġinput": 663,
      "\\\\[\\": 664,
      "Ġlength": 665,
      "Ġboth": 666,
      "Ġline": 667,
      "\\\\).\\": 668,
      "Ġuse": 669,
      "Ġrel": 670,
      "Ġonly": 671,
      "Ġwould": 672,
      "Ġsection": 673,
      "left": 674,
      "Ġsm": 675,
      "Ġsquare": 676,
      "nthere": 677,
      "Ġdeta": 678,
      "ire": 679,
      "alcul": 680,
      "Ġ\\\\)\\": 681,
      "Ġabout": 682,
      "Ġnumbers": 683,
      "ard": 684,
      "ra": 685,
      "ip": 686,
      "Ġexplor": 687,
      "ong": 688,
      "Ġmat": 689,
      "ctions": 690,
      "Ġfollow": 691,
      "Ġ|": 692,
      "Ġusing": 693,
      "Ġ12": 694,
      "ines": 695,
      "urrent": 696,
      "ides": 697,
      "Ġsol": 698,
      "ntherefore": 699,
      "ary": 700,
      "atic": 701,
      "ents": 702,
      "able": 703,
      "dit": 704,
      "nfor": 705,
      "ance": 706,
      "gn": 707,
      "po": 708,
      "Ġspecif": 709,
      "Ġgiven": 710,
      "Ġâī": 711,
      "ffic": 712,
      "Ġarea": 713,
      "ne": 714,
      "Ġpair": 715,
      "Ġcircle": 716,
      "nm": 717,
      "orm": 718,
      ")/": 719,
      "ious": 720,
      "Ġtheir": 721,
      "Ġgr": 722,
      "Ġli": 723,
      "Ġcont": 724,
      "Ġref": 725,
      "Ġq": 726,
      "ffici": 727,
      "ates": 728,
      "ass": 729,
      "ical": 730,
      "Ġbec": 731,
      "ify": 732,
      "Ġequation": 733,
      "Ġsequ": 734,
      "Ġfunction": 735,
      "nif": 736,
      "der": 737,
      "Ġremain": 738,
      "Ġmust": 739,
      "ments": 740,
      "12": 741,
      "|>\\": 742,
      "ves": 743,
      "Ġcurrent": 744,
      "Ġfinal": 745,
      "Ġdigit": 746,
      "..": 747,
      "ange": 748,
      "000": 749,
      "Ġsystem": 750,
      "Ġexample": 751,
      "Ġcomput": 752,
      "Ġdoes": 753,
      "Ġcheck": 754,
      "Ġover": 755,
      "Ġcy": 756,
      "Ġrefle": 757,
      "ues": 758,
      "Ġlar": 759,
      "ased": 760,
      "Ġtime": 761,
      "ile": 762,
      "Ġcalcul": 763,
      "Ġele": 764,
      "cond": 765,
      "Ġmight": 766,
      "ix": 767,
      "Ġmult": 768,
      "Ġconst": 769,
      "nthe": 770,
      "li": 771,
      "Ġed": 772,
      "ays": 773,
      "use": 774,
      "Ġsame": 775,
      "\\\\(": 776,
      "other": 777,
      "'}": 778,
      "ĠĠĠĠĠĠĠĠĠĠĠ": 779,
      "clu": 780,
      "ings": 781,
      "og": 782,
      "alle": 783,
      "Ġsolve": 784,
      "Ġhow": 785,
      "ans": 786,
      "Ġthey": 787,
      "**:\\": 788,
      "so": 789,
      "ted": 790,
      "Ġmake": 791,
      "ener": 792,
      "Ġsumm": 793,
      "cre": 794,
      "Ġanal": 795,
      "ater": 796,
      "Ġev": 797,
      "ngiven": 798,
      "',": 799,
      "od": 800,
      "Ġmod": 801,
      "Ġthem": 802,
      "Ġpart": 803,
      "ks": 804,
      "Ġinv": 805,
      "izing": 806,
      "sent": 807,
      "Ġmore": 808,
      "Ġcount": 809,
      "sum": 810,
      "Ġstart": 811,
      "Ġits": 812,
      "Ġsure": 813,
      "Ġtoo": 814,
      "Ġposition": 815,
      "Ġoutput": 816,
      "ices": 817,
      "Ġsee": 818,
      "}}": 819,
      "Ġfact": 820,
      "{\\\\": 821,
      "from": 822,
      "ens": 823,
      "Ġopt": 824,
      "cos": 825,
      "ph": 826,
      "Ġcondit": 827,
      "Ġass": 828,
      "nsim": 829,
      "Ġbased": 830,
      "Ġloo": 831,
      "Ġlike": 832,
      "ause": 833,
      "Ġprecise": 834,
      "Ġyour": 835,
      "Ġdivis": 836,
      "----": 837,
      "Ġsecond": 838,
      "nfirst": 839,
      "pend": 840,
      "Ġget": 841,
      "urate": 842,
      "Ġaccurate": 843,
      "ove": 844,
      "Ġback": 845,
      "Ġthree": 846,
      "ite": 847,
      "enter": 848,
      "nh": 849,
      "Ġsequence": 850,
      "value": 851,
      "ilarly": 852,
      "istant": 853,
      "ose": 854,
      "Ġiter": 855,
      "Ġcycle": 856,
      "Ġinvol": 857,
      "\",": 858,
      "Ġnew": 859,
      "nc": 860,
      "Ġsummar": 861,
      "Ġsides": 862,
      "Ġarr": 863,
      "Ġ`": 864,
      "ace": 865,
      "Ġdetail": 866,
      "fficient": 867,
      "Ġce": 868,
      "Ġmaximum": 869,
      "Ġsystematic": 870,
      "Ġcompute": 871,
      "Ġrequ": 872,
      "Ġquestions": 873,
      "Ġthinking": 874,
      "Ġright": 875,
      "Ġmatch": 876,
      "na": 877,
      "-----": 878,
      "Ġsummarizing": 879,
      "Ġformatted": 880,
      "Ġrequire": 881,
      "imal": 882,
      "Ġmulti": 883,
      "Ġ{'": 884,
      "))": 885,
      "aph": 886,
      "Ġvalues": 887,
      "ating": 888,
      "Ġside": 889,
      "Ġdistance": 890,
      "sin": 891,
      "Ġintegers": 892,
      "Ġlist": 893,
      "Ġchoo": 894,
      "Ġ20": 895,
      "fter": 896,
      "Ġgener": 897,
      "Ġexpression": 898,
      "pi": 899,
      "ound": 900,
      "Ġun": 901,
      "}\\\\": 902,
      "20": 903,
      "Ġinclu": 904,
      "Ġinterse": 905,
      "Ġpositions": 906,
      "trac": 907,
      "Ġorder": 908,
      "ots": 909,
      "Ġbecause": 910,
      "Ġear": 911,
      "Ġleast": 912,
      "par": 913,
      "Ġpositive": 914,
      "ular": 915,
      "Ġyou": 916,
      "Ġans": 917,
      "Ġ100": 918,
      ")(": 919,
      "Ġanswer": 920,
      "vers": 921,
      "Ġdoesn": 922,
      "Ġprint": 923,
      "king": 924,
      "ess": 925,
      "##": 926,
      "Ġag": 927,
      "Ġproper": 928,
      "Ġsat": 929,
      "Ġwhen": 930,
      "Ġeven": 931,
      "Ġformul": 932,
      "Ġvar": 933,
      "ied": 934,
      "):\\": 935,
      "ĠÎ": 936,
      "isf": 937,
      "ting": 938,
      "Ġrow": 939,
      "Ġta": 940,
      "Ġlog": 941,
      "Ġ(-": 942,
      "Ġman": 943,
      "}\\": 944,
      "Ġsatisf": 945,
      "Ġreach": 946,
      "igh": 947,
      "Ġprev": 948,
      "nsimilarly": 949,
      "Ġwhat": 950,
      "lier": 951,
      "ters": 952,
      "loor": 953,
      "Ġvalue": 954,
      "{(": 955,
      "Ġdeg": 956,
      "25": 957,
      "equ": 958,
      "Ġrec": 959,
      "plic": 960,
      "99": 961,
      "'t": 962,
      "Ġdirect": 963,
      "ases": 964,
      "Ġbefore": 965,
      "clus": 966,
      "Ġpath": 967,
      "Ġ\\\\).": 968,
      "Ġformula": 969,
      "ving": 970,
      "Ġearlier": 971,
      "Ġnon": 972,
      "Ġsample": 973,
      "Ġvert": 974,
      "nect": 975,
      "olutions": 976,
      "Īļ": 977,
      "ible": 978,
      "ice": 979,
      "pe": 980,
      "ssign": 981,
      "Ġprod": 982,
      "Ġpropert": 983,
      "ie": 984,
      "ints": 985,
      "Ġsolutions": 986,
      "ges": 987,
      "Ġread": 988,
      "leq": 989,
      "bin": 990,
      "Ġagain": 991,
      "Ġgraph": 992,
      "Ġhere": 993,
      "ig": 994,
      "}\\\\)": 995,
      "Ġmultiple": 996,
      "Ġnecess": 997,
      "set": 998,
      "16": 999,
      "nto": 1000,
      "Ġ16": 1001,
      "Ġ<=": 1002,
      "Ġden": 1003,
      "Ġangles": 1004,
      "Ġafter": 1005,
      "Ġnow": 1006,
      "ordin": 1007,
      "Ġmain": 1008,
      "age": 1009,
      "Ġadd": 1010,
      "no": 1011,
      "Ġalso": 1012,
      "Ġconnect": 1013,
      "ough": 1014,
      "Ġlong": 1015,
      "Ġzer": 1016,
      "Ġpar": 1017,
      "Ġprevious": 1018,
      "ys": 1019,
      "cir": 1020,
      "read": 1021,
      "}}{": 1022,
      "now": 1023,
      "Ġchoose": 1024,
      "clusion": 1025,
      "Ġpairs": 1026,
      "Ġspecific": 1027,
      "Ġoper": 1028,
      "Ġprov": 1029,
      "Ġassign": 1030,
      "Ġsqrt": 1031,
      "isit": 1032,
      "nder": 1033,
      "dd": 1034,
      "etr": 1035,
      "Ġabove": 1036,
      "Ġsepar": 1037,
      "Ġdigits": 1038,
      "Ġneeded": 1039,
      "Ġpoly": 1040,
      "Ġsmall": 1041,
      "Ġ==": 1042,
      "ucture": 1043,
      "][": 1044,
      "Ġ15": 1045,
      "app": 1046,
      "ps": 1047,
      "Ġgre": 1048,
      "Ġstructure": 1049,
      "ers": 1050,
      "Ġefficient": 1051,
      "term": 1052,
      "Ġcontain": 1053,
      "Ġlines": 1054,
      "Ġwor": 1055,
      "Ġfollowing": 1056,
      "Ġ>=": 1057,
      "Ġodd": 1058,
      "form": 1059,
      "Ġ11": 1060,
      "Ġens": 1061,
      "iding": 1062,
      "gr": 1063,
      "Ġproduct": 1064,
      "pm": 1065,
      "Ġcondition": 1066,
      "Ġelements": 1067,
      "ma": 1068,
      "Ġcell": 1069,
      "bf": 1070,
      "nmaybe": 1071,
      "Ġleft": 1072,
      "adi": 1073,
      "Ġinde": 1074,
      "rees": 1075,
      "Ġexact": 1076,
      "Ġori": 1077,
      "?\\": 1078,
      "Ġedges": 1079,
      "Ġide": 1080,
      "pect": 1081,
      "Ġlook": 1082,
      "Ġatt": 1083,
      "Ġbr": 1084,
      "Ġsort": 1085,
      "],": 1086,
      "Ġknow": 1087,
      "Ġcenter": 1088,
      "quad": 1089,
      "Ġless": 1090,
      "yth": 1091,
      "Ġprime": 1092,
      "Ġquestion": 1093,
      "Ġmy": 1094,
      "Ġverify": 1095,
      "Ġrange": 1096,
      "Ġinclude": 1097,
      "Ġ\\\\[": 1098,
      "Ġchar": 1099,
      "Ġwill": 1100,
      "final": 1101,
      "Ġincre": 1102,
      "Ġseg": 1103,
      "its": 1104,
      "plement": 1105,
      "15": 1106,
      "Ġcould": 1107,
      "ator": 1108,
      "Ġhand": 1109,
      "nsu": 1110,
      "Ġdp": 1111,
      "pha": 1112,
      "Ġcle": 1113,
      "Ġproperties": 1114,
      "ĨĴ": 1115,
      "allest": 1116,
      "Ġplan": 1117,
      "ually": 1118,
      "Ġcoordin": 1119,
      "empt": 1120,
      "``": 1121,
      "100": 1122,
      "Ġgu": 1123,
      "ility": 1124,
      "Ġ\\\\):\\": 1125,
      "thet": 1126,
      "Ġunder": 1127,
      "Ġer": 1128,
      "que": 1129,
      "Ġconstra": 1130,
      "he": 1131,
      "Ġorigin": 1132,
      "(\\\\": 1133,
      "Ġdeterm": 1134,
      "Ġdon": 1135,
      "urn": 1136,
      "ying": 1137,
      "âĢ": 1138,
      "ĠâĨĴ": 1139,
      "Ġâī¤": 1140,
      "Ġadj": 1141,
      "ds": 1142,
      "Ġanother": 1143,
      "Ġsmallest": 1144,
      "cy": 1145,
      "Ġ18": 1146,
      "Ġhel": 1147,
      "Ġwell": 1148,
      "les": 1149,
      "np": 1150,
      "Ġconf": 1151,
      "gest": 1152,
      "Ġ25": 1153,
      "Ġfour": 1154,
      "Ġzero": 1155,
      "\\\\)\\": 1156,
      "ute": 1157,
      "Ġclear": 1158,
      "Ġgrou": 1159,
      "Ġvertices": 1160,
      "ording": 1161,
      "},": 1162,
      "Ġnecessary": 1163,
      "Ġbetter": 1164,
      "Ġfollows": 1165,
      "Ġdirectly": 1166,
      "Ġke": 1167,
      "inct": 1168,
      "math": 1169,
      "mm": 1170,
      "ict": 1171,
      "itial": 1172,
      "Ġ13": 1173,
      "Ġgo": 1174,
      "Ġ\\\\[\\": 1175,
      "velo": 1176,
      "ences": 1177,
      "Ġreflection": 1178,
      "ert": 1179,
      "nper": 1180,
      "bo": 1181,
      "Ġexactly": 1182,
      "Ġerr": 1183,
      "Ġact": 1184,
      "res": 1185,
      "Ġpresent": 1186,
      "Ġend": 1187,
      "ives": 1188,
      "Ġsimilar": 1189,
      "Ġdistinct": 1190,
      "theta": 1191,
      ")=": 1192,
      "Ġshow": 1193,
      "Ġcalculate": 1194,
      "Ġtimes": 1195,
      "Ġrepre": 1196,
      "ason": 1197,
      "Ġrequires": 1198,
      "Ġwin": 1199,
      "Ġensure": 1200,
      "row": 1201,
      "alpha": 1202,
      "imize": 1203,
      "Ġquad": 1204,
      "Ġinvolves": 1205,
      "__": 1206,
      "cept": 1207,
      "Ġreason": 1208,
      ").": 1209,
      "Ġcode": 1210,
      "ython": 1211,
      "Ġstring": 1212,
      "**:": 1213,
      "Ġtang": 1214,
      "Ġcolum": 1215,
      "ding": 1216,
      "Ġminimal": 1217,
      "Ġcolor": 1218,
      "*(": 1219,
      "ick": 1220,
      "ppose": 1221,
      "Ġdegrees": 1222,
      "Ġmany": 1223,
      "}^{": 1224,
      "thing": 1225,
      "Ġrele": 1226,
      "agon": 1227,
      "lect": 1228,
      "consider": 1229,
      "Ġreflections": 1230,
      "Ġminimum": 1231,
      "bab": 1232,
      "Ġattempt": 1233,
      "Ġspecified": 1234,
      "Ġcharac": 1235,
      "Ġaccording": 1236,
      "Ġmatches": 1237,
      "ysis": 1238,
      "Ġconstraints": 1239,
      "vant": 1240,
      "Ġel": 1241,
      "Ġexist": 1242,
      "Ġconclusion": 1243,
      "Ġlead": 1244,
      "Ġanalysis": 1245,
      "Ġresult": 1246,
      "Ġwithout": 1247,
      "Ġsc": 1248,
      "rib": 1249,
      "Ġ#": 1250,
      "13": 1251,
      "Ġseparated": 1252,
      "Ġeng": 1253,
      "Ġam": 1254,
      "$\\": 1255,
      "dent": 1256,
      "Ġimplement": 1257,
      "Ġconsidering": 1258,
      "orough": 1259,
      "Ġthorough": 1260,
      "oc": 1261,
      "Ġhigh": 1262,
      "Ġbc": 1263,
      "Ġsimpl": 1264,
      "Ġvarious": 1265,
      "Ġ->": 1266,
      "stand": 1267,
      "Ġrev": 1268,
      "\\',": 1269,
      "Ġreg": 1270,
      "Ġ14": 1271,
      ":**": 1272,
      "lines": 1273,
      "ved": 1274,
      "nperhaps": 1275,
      "nwh": 1276,
      "Ġrelevant": 1277,
      "gative": 1278,
      "velop": 1279,
      "Ġtriangles": 1280,
      "Ġrole": 1281,
      "Ġreasoning": 1282,
      "aging": 1283,
      "nan": 1284,
      "Ġdevelop": 1285,
      "ensive": 1286,
      "Ġbacktrac": 1287,
      "fix": 1288,
      "nsince": 1289,
      "Ġassum": 1290,
      "Ġdivisible": 1291,
      "Ġrespon": 1292,
      "icular": 1293,
      "str": 1294,
      "ild": 1295,
      "vect": 1296,
      "Ġiteration": 1297,
      "Ġprobab": 1298,
      "ĠÏ": 1299,
      "ote": 1300,
      "Ġcomple": 1301,
      "'m": 1302,
      "Ġerrors": 1303,
      "geq": 1304,
      "fining": 1305,
      "Ġsections": 1306,
      "cum": 1307,
      "14": 1308,
      "sy": 1309,
      "iled": 1310,
      "Ġlarge": 1311,
      "Ġcomplic": 1312,
      "Ġmeans": 1313,
      "Ġattempts": 1314,
      "Ġdis": 1315,
      "ithm": 1316,
      "Ġbrain": 1317,
      "your": 1318,
      "output": 1319,
      "isiting": 1320,
      "adius": 1321,
      "]}": 1322,
      "Ġresponse": 1323,
      "Ġcu": 1324,
      "Ġproviding": 1325,
      "xed": 1326,
      "Ġple": 1327,
      "kes": 1328,
      "Ġcompre": 1329,
      "Ġcompreh": 1330,
      "Ġcomm": 1331,
      "Ġconsiderations": 1332,
      "Ġdetailed": 1333,
      "Ġlogical": 1334,
      "des": 1335,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1336,
      "Ġfe": 1337,
      "yle": 1338,
      "racy": 1339,
      "ities": 1340,
      "Ġguide": 1341,
      "Ġdifference": 1342,
      "Ġaccu": 1343,
      "Ġreal": 1344,
      "Ġaccuracy": 1345,
      "Ġassistant": 1346,
      "Ġred": 1347,
      "Ġexploring": 1348,
      "Ġsystematically": 1349,
      "Ġverifying": 1350,
      "Ġrevisiting": 1351,
      "Ġideas": 1352,
      "Ġcomprehensive": 1353,
      "Ġplay": 1354,
      "Ġoriginal": 1355,
      "Ġplease": 1356,
      "âĢĻ": 1357,
      "user": 1358,
      "Ġcircum": 1359,
      "Ġconcise": 1360,
      "Ġfindings": 1361,
      "Ġ'\\": 1362,
      "-----\\": 1363,
      "Ġpower": 1364,
      "ati": 1365,
      "...": 1366,
      "Ġexploration": 1367,
      "versations": 1368,
      "ful": 1369,
      "system": 1370,
      ":\",": 1371,
      "Ġthoroughly": 1372,
      "Ġguidelines": 1373,
      "Ġstyle": 1374,
      "Ġreass": 1375,
      "essment": 1376,
      "storm": 1377,
      "Ġvect": 1378,
      "Ġ[{": 1379,
      "Ġrefining": 1380,
      "Ġbrainstorm": 1381,
      "assistant": 1382,
      "Ġengaging": 1383,
      "Ġdeem": 1384,
      "Ġexplorations": 1385,
      "considered": 1386,
      "Ġbrainstorming": 1387,
      "Ġreassessment": 1388,
      "isying": 1389,
      "conversations": 1390,
      "Ġanalisying": 1391,
      "Ġbacktracing": 1392,
      "Ġ[{'": 1393,
      "})": 1394,
      "rix": 1395,
      "nanother": 1396,
      "Ġmove": 1397,
      "respon": 1398,
      "Ġcost": 1399,
      "Ġgives": 1400,
      "line": 1401,
      "Ġcomplicated": 1402,
      "Ġcorrespon": 1403,
      "omial": 1404,
      "ck": 1405,
      "Ġbu": 1406,
      "Ġcoordinates": 1407,
      "com": 1408,
      "Ġroots": 1409,
      "Ġuni": 1410,
      "Ġtake": 1411,
      "ateral": 1412,
      "Ġheight": 1413,
      "Ġfactor": 1414,
      "Ġsubset": 1415,
      "boxed": 1416,
      "Ġwr": 1417,
      "Ġstill": 1418,
      "Ġ24": 1419,
      "ency": 1420,
      "plies": 1421,
      "\\\\).": 1422,
      "Ġrepresent": 1423,
      "ear": 1424,
      "ron": 1425,
      "Ġedge": 1426,
      "ertain": 1427,
      "Ġsomething": 1428,
      "Ġrati": 1429,
      "18": 1430,
      "Ġbase": 1431,
      "24": 1432,
      "mpt": 1433,
      "Ġcertain": 1434,
      "(-": 1435,
      "âĪļ": 1436,
      "lf": 1437,
      "Ġbl": 1438,
      "Ġvalid": 1439,
      "Ġremaining": 1440,
      "Ġtest": 1441,
      "port": 1442,
      "Ġcombin": 1443,
      "Ġgeneral": 1444,
      "Ġmean": 1445,
      "Ġcos": 1446,
      "Ġind": 1447,
      "Ġunderstand": 1448,
      "Ġsatisfy": 1449,
      "tex": 1450,
      "Ġhol": 1451,
      "otal": 1452,
      "}{\\\\": 1453,
      "Ġwithin": 1454,
      "Ġintersection": 1455,
      "asing": 1456,
      "Ġhelp": 1457,
      "Ġinitial": 1458,
      "rack": 1459,
      "Ġcases": 1460,
      "Ġstarting": 1461,
      "$,": 1462,
      "arr": 1463,
      "Ġhandle": 1464,
      "Ġbit": 1465,
      "Ġdefin": 1466,
      "nsuppose": 1467,
      "Ġgreater": 1468,
      "Ġoperations": 1469,
      "ided": 1470,
      "ata": 1471,
      "one": 1472,
      "Ġnext": 1473,
      "nfrom": 1474,
      "hehe": 1475,
      "ready": 1476,
      "Ġkeep": 1477,
      "Ġte": 1478,
      "Ġmid": 1479,
      "'},": 1480,
      "###": 1481,
      "ement": 1482,
      "}\\\\),": 1483,
      ")\\\\)": 1484,
      "Ġarray": 1485,
      "Ġrect": 1486,
      "Ġvertex": 1487,
      "ometr": 1488,
      "ny": 1489,
      "Ġrecall": 1490,
      "equal": 1491,
      "pendicular": 1492,
      "Ġpython": 1493,
      "ĠÃ": 1494,
      "60": 1495,
      "omin": 1496,
      "Ġperpendicular": 1497,
      "aces": 1498,
      "Ġgroup": 1499,
      "turn": 1500,
      "Ġallow": 1501,
      "Ġalready": 1502,
      "Ġintersect": 1503,
      "nthus": 1504,
      "Ġfloor": 1505,
      "Ġdef": 1506,
      "Ġgrid": 1507,
      "Ġdes": 1508,
      "Ġcover": 1509,
      "Ġbeing": 1510,
      "ract": 1511,
      "Ġcons": 1512,
      "Ġ}": 1513,
      "not": 1514,
      "Ġinequal": 1515,
      "Ġrespect": 1516,
      "Ġlast": 1517,
      "nand": 1518,
      "Ġword": 1519,
      "Ġgetting": 1520,
      "Ġcommon": 1521,
      "side": 1522,
      "Ġtangent": 1523,
      "Ġsin": 1524,
      "Ġbound": 1525,
      "Ġsums": 1526,
      "plit": 1527,
      "ption": 1528,
      "Ġident": 1529,
      "Ġmodul": 1530,
      "Ġdetermine": 1531,
      "equiv": 1532,
      "Ġunique": 1533,
      "Ġprefix": 1534,
      "ug": 1535,
      "hip": 1536,
      ")}": 1537,
      "Ġsquares": 1538,
      "Ġty": 1539,
      "Ġconnected": 1540,
      "Ġfre": 1541,
      "Ġap": 1542,
      "Ġpass": 1543,
      "\"\\": 1544,
      "over": 1545,
      "Ġstu": 1546,
      "Ġactually": 1547,
      "nomial": 1548,
      "Ġever": 1549,
      "textbf": 1550,
      "Ġrelated": 1551,
      "Ġwork": 1552,
      "Â°": 1553,
      "di": 1554,
      "Ġpolynomial": 1555,
      "Ġdifferently": 1556,
      "ither": 1557,
      "Ġ30": 1558,
      "ffect": 1559,
      "Ġjust": 1560,
      "Ġlengths": 1561,
      "Ġplane": 1562,
      "Ġtrans": 1563,
      "Ġrelations": 1564,
      "Ġcircles": 1565,
      "Ġ+=": 1566,
      "^\\\\": 1567,
      "Ġoptions": 1568,
      "Ġday": 1569,
      "Ġmis": 1570,
      "Ġbin": 1571,
      "ird": 1572,
      "Ġnegative": 1573,
      "Ġcoe": 1574,
      "Ġcontains": 1575,
      "qquad": 1576,
      "Ġperm": 1577,
      "Ġmodulo": 1578,
      "Ġequations": 1579,
      "circ": 1580,
      "Ġsw": 1581,
      "Ġsmaller": 1582,
      "Ġcard": 1583,
      "Ġrectangle": 1584,
      "Ġselect": 1585,
      "Ġconditions": 1586,
      "Ġ19": 1587,
      "din": 1588,
      "ward": 1589,
      "Ġelse": 1590,
      "17": 1591,
      "Ġtrack": 1592,
      "ign": 1593,
      "def": 1594,
      "Ġadjac": 1595,
      "Ġroot": 1596,
      "circle": 1597,
      "sing": 1598,
      "co": 1599,
      "Ġlarger": 1600,
      "nwe": 1601,
      "hed": 1602,
      "):": 1603,
      "Ġtop": 1604,
      "ational": 1605,
      "Ġconsist": 1606,
      "Ġways": 1607,
      "wise": 1608,
      "ex": 1609,
      "))\\": 1610,
      "Ġsing": 1611,
      "Ġoption": 1612,
      "ponent": 1613,
      "Ġabc": 1614,
      "Ġcells": 1615,
      "((": 1616,
      "Ġconstant": 1617,
      "ately": 1618,
      "ari": 1619,
      "Ġpat": 1620,
      "Ġ50": 1621,
      "ceed": 1622,
      "ĠâĪļ": 1623,
      "19": 1624,
      "Ġefficiently": 1625,
      "50": 1626,
      "vec": 1627,
      "()\\": 1628,
      "Ġarrang": 1629,
      "Ġsize": 1630,
      "Ġiterate": 1631,
      "Ġwait": 1632,
      "Ġcolumn": 1633,
      "del": 1634,
      "}(": 1635,
      "Ġent": 1636,
      "ever": 1637,
      "ances": 1638,
      "log": 1639,
      "Ġpermut": 1640,
      "Ġclo": 1641,
      "Ġ-\\\\": 1642,
      "ind": 1643,
      "Ġrelationship": 1644,
      "Ġprobability": 1645,
      "Ġradius": 1646,
      "Ġsays": 1647,
      "Ġmost": 1648,
      "Ġsingle": 1649,
      "Ġtree": 1650,
      "Ġsay": 1651,
      "gon": 1652,
      "Ġlargest": 1653,
      "Ġexists": 1654,
      "Ġob": 1655,
      "Ġevery": 1656,
      "gy": 1657,
      "Ġ200": 1658,
      "nx": 1659,
      "Ġinterval": 1660,
      "Ġ&": 1661,
      "^{-": 1662,
      "possible": 1663,
      "Ġfix": 1664,
      "ax": 1665,
      "to": 1666,
      "Ġdivides": 1667,
      "Ġcl": 1668,
      "ways": 1669,
      "Ġtrue": 1670,
      "Ġnode": 1671,
      "Ġused": 1672,
      "Ġratio": 1673,
      "Ġav": 1674,
      "point": 1675,
      "ĠÎ¸": 1676,
      "Ġ17": 1677,
      "ood": 1678,
      "Ġ60": 1679,
      "omes": 1680,
      "Ġparalle": 1681,
      ")}\\\\": 1682,
      "nalso": 1683,
      "Ġmoves": 1684,
      "ition": 1685,
      "Ġelement": 1686,
      "ross": 1687,
      "Ġ...": 1688,
      "ail": 1689,
      "isect": 1690,
      "ponents": 1691,
      "Ġrelate": 1692,
      "Ġsegments": 1693,
      "bd": 1694,
      "Ġinequality": 1695,
      "Ġreturn": 1696,
      "]=": 1697,
      "Ġge": 1698,
      "Ġdenote": 1699,
      "for": 1700,
      "und": 1701,
      "0000": 1702,
      "Ġplace": 1703,
      "rf": 1704,
      "Ġshe": 1705,
      "gor": 1706,
      "Ġcomplex": 1707,
      ":**\\": 1708,
      "anges": 1709,
      "Ġlow": 1710,
      "Ġbecomes": 1711,
      "Ġstand": 1712,
      "ake": 1713,
      "ls": 1714,
      "30": 1715,
      "])\\": 1716,
      "Ġsys": 1717,
      "```": 1718,
      "own": 1719,
      "Ġrot": 1720,
      "Ġsegment": 1721,
      "sec": 1722,
      "etic": 1723,
      "check": 1724,
      "stit": 1725,
      "av": 1726,
      "max": 1727,
      "posit": 1728,
      "nne": 1729,
      "Ġ\\\\((": 1730,
      "Ġeither": 1731,
      "count": 1732,
      "40": 1733,
      "33": 1734,
      "Ġthose": 1735,
      "$$\\": 1736,
      "dition": 1737,
      "Ġalways": 1738,
      "Ġquadr": 1739,
      "ga": 1740,
      "Ġunits": 1741,
      "Ġgeometr": 1742,
      "Ġbisect": 1743,
      "ndef": 1744,
      "ĠÃĹ": 1745,
      "fect": 1746,
      "Ġoverl": 1747,
      "sequ": 1748,
      "Ġvari": 1749,
      "Ġthird": 1750,
      "Ġadjacent": 1751,
      "edi": 1752,
      "Ġ40": 1753,
      "pmod": 1754,
      "Ġtheore": 1755,
      "tract": 1756,
      "Ġdenomin": 1757,
      "ively": 1758,
      "Ġpattern": 1759,
      "olum": 1760,
      "pro": 1761,
      "ak": 1762,
      "Ġ36": 1763,
      "\".\\": 1764,
      "Ġdec": 1765,
      "Ġperform": 1766,
      "uch": 1767,
      "secut": 1768,
      "Ġgcd": 1769,
      "Ġcomp": 1770,
      "iply": 1771,
      "ntotal": 1772,
      ")}{": 1773,
      "Ġfactors": 1774,
      "ale": 1775,
      "omega": 1776,
      "Ġstra": 1777,
      "Ġax": 1778,
      "Ġext": 1779,
      "min": 1780,
      "ially": 1781,
      "Ġnodes": 1782,
      "noutput": 1783,
      "raw": 1784,
      "Ġ90": 1785,
      "Ġstraight": 1786,
      "Ġdistances": 1787,
      "agonal": 1788,
      "ual": 1789,
      "Ġcharacters": 1790,
      "Ġdivide": 1791,
      "mathbf": 1792,
      "nst": 1793,
      "here": 1794,
      "secutive": 1795,
      "Ġdown": 1796,
      "ninput": 1797,
      "Ġminute": 1798,
      "ril": 1799,
      "32": 1800,
      "Ġblo": 1801,
      "Ġfrequ": 1802,
      "round": 1803,
      "Ġvector": 1804,
      "Ġsorted": 1805,
      "Ġfl": 1806,
      "verse": 1807,
      "Ġwhile": 1808,
      "Ġsymm": 1809,
      "ject": 1810,
      "Ġsequences": 1811,
      "Ġdou": 1812,
      "nhence": 1813,
      ")^{": 1814,
      "Ġtheorem": 1815,
      "Ġ\\\\\\\\": 1816,
      "Ġconsecutive": 1817,
      "Ġremo": 1818,
      "Ġru": 1819,
      "36": 1820,
      "Ġdivided": 1821,
      "Ġstandard": 1822,
      "Ġins": 1823,
      "Ġletters": 1824,
      "ants": 1825,
      "\\\\):\\": 1826,
      "Ġsen": 1827,
      "imiz": 1828,
      "Ġcannot": 1829,
      "rilateral": 1830,
      "200": 1831,
      "Ġsug": 1832,
      "Ġarc": 1833,
      "Ġfract": 1834,
      "Ġonce": 1835,
      "Ġindex": 1836,
      "Ġdecre": 1837,
      "Ġ1000": 1838,
      "Ġbinary": 1839,
      "ighb": 1840,
      "nalright": 1841,
      "Ġquadrilateral": 1842,
      "bda": 1843,
      "ambda": 1844,
      ",\\": 1845,
      "Ġdepend": 1846,
      "binom": 1847,
      "Ġareas": 1848,
      "Ġcharacter": 1849,
      "Ġgot": 1850,
      "Ġmaximize": 1851,
      "Ġâĩ": 1852,
      "nse": 1853,
      "Ġmeaning": 1854,
      "Ġentire": 1855,
      "Ġparallel": 1856,
      "ĠâĩĴ": 1857,
      "ribut": 1858,
      "Ġchange": 1859,
      "Ġrequired": 1860,
      "Ġsuggest": 1861,
      "Ġ$\\\\": 1862,
      "Ġcare": 1863,
      "Ġfound": 1864,
      "Ġla": 1865,
      "}\\\\).\\": 1866,
      "digit": 1867,
      "lambda": 1868,
      ")*": 1869,
      "gorithm": 1870,
      "Ġdouble": 1871,
      "Ġlinear": 1872,
      "ply": 1873,
      "Ġaccept": 1874,
      "fficients": 1875,
      "pr": 1876,
      "Ġdiagonal": 1877,
      "].\\": 1878,
      "Ġvariable": 1879,
      ")/(": 1880,
      "ÏĢ": 1881,
      "Ġcoefficients": 1882,
      "Ġcalculation": 1883,
      "Ġcre": 1884,
      "apping": 1885,
      "Ġ\\\\):": 1886,
      "Ġph": 1887,
      "Ġperfect": 1888,
      "21": 1889,
      "75": 1890,
      "gram": 1891,
      "Ġwrite": 1892,
      "Ġmodel": 1893,
      "Ġsatisfies": 1894,
      "Ġsymmetr": 1895,
      "}]}": 1896,
      "Ġinfin": 1897,
      "Ġ\"<|": 1898,
      "cc": 1899,
      "Ġsense": 1900,
      "atrix": 1901,
      "Ġpe": 1902,
      "Ġoperation": 1903,
      "Ġblack": 1904,
      "Ġquadratic": 1905,
      "Ġinc": 1906,
      "\"}]}": 1907,
      "Ġvolum": 1908,
      "ced": 1909,
      "Ġalgorithm": 1910,
      "Ġoff": 1911,
      "Ġcircumcircle": 1912,
      "Ġinside": 1913,
      "get": 1914,
      "ott": 1915,
      "Ġcho": 1916,
      "Ġdefine": 1917,
      "Ġopp": 1918,
      "Ġhal": 1919,
      "ĠâīĪ": 1920,
      "ib": 1921,
      "uring": 1922,
      "Ġcd": 1923,
      "rection": 1924,
      "Ġleading": 1925,
      "ĠâĪ": 1926,
      "ĠâĢ": 1927,
      "Ġsubsequ": 1928,
      "arch": 1929,
      "Ġwas": 1930,
      "Ġsubstr": 1931,
      "Ġcent": 1932,
      "Ġassume": 1933,
      "Ġstates": 1934,
      "Ġweight": 1935,
      "nwhich": 1936,
      "Ġ%": 1937,
      "nre": 1938,
      "Ġfaces": 1939,
      "Ġcareful": 1940,
      "Î¸": 1941,
      "Ġrows": 1942,
      "Ġempt": 1943,
      "ically": 1944,
      "Ġholds": 1945,
      "Ġcorrectly": 1946,
      "Ġmon": 1947,
      "Ġmakes": 1948,
      "Ġdirection": 1949,
      "rox": 1950,
      "Ġleve": 1951,
      "28": 1952,
      "Ġindeed": 1953,
      "Ġhigher": 1954,
      "Ġwho": 1955,
      "nhow": 1956,
      "ches": 1957,
      "ears": 1958,
      "ä¸": 1959,
      "Ġwords": 1960,
      "oriz": 1961,
      "Ġdata": 1962,
      "ague": 1963,
      "Ġdegree": 1964,
      "Ġplayer": 1965,
      "pute": 1966,
      "Ġdays": 1967,
      "Ġempty": 1968,
      "Ġ27": 1969,
      "Ġcolors": 1970,
      "ish": 1971,
      "Ġ'<|": 1972,
      "ield": 1973,
      "'}]}": 1974,
      "ner": 1975,
      "son": 1976,
      "Ġamong": 1977,
      "Ġexpressed": 1978,
      "Ġdenominator": 1979,
      "Ġsimplify": 1980,
      "Ġdesc": 1981,
      "Ġalong": 1982,
      "Ġincreasing": 1983,
      "approx": 1984,
      "Ġplac": 1985,
      "Ġfunctions": 1986,
      "Ġparts": 1987,
      "Ġsets": 1988,
      "Ġâī¡": 1989,
      "Ġvague": 1990,
      "Ġdivisors": 1991,
      "Ġaddition": 1992,
      "$.": 1993,
      "Ġ$$": 1994,
      "Ġbuild": 1995,
      "Ġfinding": 1996,
      "arily": 1997,
      "orizon": 1998,
      "Ġredu": 1999,
      "Ġcall": 2000,
      "Ġneighb": 2001,
      "Ġfig": 2002,
      "itu": 2003,
      "Ġstate": 2004,
      "Ġchanges": 2005,
      "tan": 2006,
      "ory": 2007,
      "urs": 2008,
      "Ġinvolved": 2009,
      "Ġmess": 2010,
      "Ġcoin": 2011,
      "Ġrepe": 2012,
      "Ġdraw": 2013,
      "Ġ180": 2014,
      "Ġyes": 2015,
      "Ġprove": 2016,
      "input": 2017,
      "hedron": 2018,
      "Ġhalf": 2019,
      "Ġcube": 2020,
      "Ġmar": 2021,
      "Ġmatrix": 2022,
      "Ġvolume": 2023,
      "Ġfigure": 2024,
      "Ġbre": 2025,
      "Ġbott": 2026,
      "ade": 2027,
      "Ġtherefore": 2028,
      "Ġach": 2029,
      "ask": 2030,
      "nhmm": 2031,
      "Ġneeds": 2032,
      "Ġmist": 2033,
      "Ġaround": 2034,
      "Ġ32": 2035,
      "Ġaffect": 2036,
      "Ġstat": 2037,
      "Ġhorizon": 2038,
      "up": 2039,
      "using": 2040,
      "Ġprimes": 2041,
      "osit": 2042,
      "Ġadjust": 2043,
      "Ġapprox": 2044,
      "Ġachie": 2045,
      "Ġminimize": 2046,
      "nyes": 2047,
      "|>\"}]}": 2048,
      "amma": 2049,
      "kay": 2050,
      "Ġapproxim": 2051,
      "Ġ!": 2052,
      "Ġexp": 2053,
      "nhowever": 2054,
      "Ġser": 2055,
      "Ġpaths": 2056,
      "valid": 2057,
      "Ġbox": 2058,
      "utes": 2059,
      "hehehehe": 2060,
      "Ġimplies": 2061,
      "Ġremove": 2062,
      "irm": 2063,
      "Ġtype": 2064,
      "the": 2065,
      "Ġ(\\\\": 2066,
      "Ġcolumns": 2067,
      "iles": 2068,
      "Ġener": 2069,
      "oid": 2070,
      "plify": 2071,
      "neq": 2072,
      "Ġsign": 2073,
      "27": 2074,
      "Ġsimplif": 2075,
      "ameter": 2076,
      "Ġchild": 2077,
      "Ġaver": 2078,
      "ldots": 2079,
      "Ġremainder": 2080,
      "implies": 2081,
      "beta": 2082,
      "abc": 2083,
      "Ġformed": 2084,
      "**\\": 2085,
      "Ġnumer": 2086,
      "Ġstud": 2087,
      "iod": 2088,
      "Ġconfirm": 2089,
      "Ġquer": 2090,
      "nis": 2091,
      "ailable": 2092,
      "Ġcub": 2093,
      "/(": 2094,
      "64": 2095,
      "Ġplus": 2096,
      "Ġgive": 2097,
      "ry": 2098,
      "Ġcards": 2099,
      "arget": 2100,
      "Ġca": 2101,
      "Ġsk": 2102,
      "osite": 2103,
      "nnext": 2104,
      "$$": 2105,
      "\\\\[\\\\": 2106,
      "formation": 2107,
      "nsample": 2108,
      "23": 2109,
      "phi": 2110,
      ")\\\\),": 2111,
      "Ġpie": 2112,
      "Ġvectors": 2113,
      "Ġhour": 2114,
      "name": 2115,
      "Ġcand": 2116,
      "Ġ!=": 2117,
      "Ġsa": 2118,
      "Ġlower": 2119,
      "Ġmeth": 2120,
      "fs": 2121,
      "ending": 2122,
      "Ġdefined": 2123,
      "ature": 2124,
      "Ġopposite": 2125,
      "Ġvisit": 2126,
      "Ġxor": 2127,
      "Ġpolygon": 2128,
      "Ġcorresponding": 2129,
      "cm": 2130,
      "bb": 2131,
      "Ġapply": 2132,
      "Ġproceed": 2133,
      "ncom": 2134,
      "Ġteam": 2135,
      "air": 2136,
      "noption": 2137,
      "Ġ45": 2138,
      "Ġsplit": 2139,
      "Ġrational": 2140,
      "Ġhy": 2141,
      "}.\\": 2142,
      "Ġround": 2143,
      "ub": 2144,
      "nsub": 2145,
      "riend": 2146,
      "Ġdetermin": 2147,
      "Ġocc": 2148,
      "Ġgood": 2149,
      "Ġfrequency": 2150,
      "cdots": 2151,
      "Ġwind": 2152,
      "Ġsubstit": 2153,
      "80": 2154,
      "ats": 2155,
      "22": 2156,
      "Ġhis": 2157,
      "Ġder": 2158,
      "nsimplify": 2159,
      "Ġconstr": 2160,
      "Ġisn": 2161,
      "Ġspace": 2162,
      "Ġsuggests": 2163,
      "Ġlen": 2164,
      "Ġequil": 2165,
      "Ġslow": 2166,
      "loo": 2167,
      "Ġconc": 2168,
      "Ġpermutation": 2169,
      "Ġ21": 2170,
      "orrect": 2171,
      "Ġperiod": 2172,
      "npr": 2173,
      "Ġexponent": 2174,
      "1111": 2175,
      "stdin": 2176,
      "().": 2177,
      "Ġenergy": 2178,
      "arrow": 2179,
      "}^": 2180,
      "Ġabs": 2181,
      "mod": 2182,
      "66": 2183,
      "Ġmultiply": 2184,
      "Ġunit": 2185,
      "Ġlim": 2186,
      "Ġspe": 2187,
      "Ġregular": 2188,
      "Ġ64": 2189,
      "main": 2190,
      "lfloor": 2191,
      "Ġaverage": 2192,
      "ln": 2193,
      "rfloor": 2194,
      "Ġfixed": 2195,
      "iction": 2196,
      "Ġscore": 2197,
      "Ġface": 2198,
      "'ve": 2199,
      "Ġmethod": 2200,
      "split": 2201,
      "ssib": 2202,
      "Ġimpossible": 2203,
      "Ġlies": 2204,
      "append": 2205,
      ";\\": 2206,
      "yes": 2207,
      "Ġsubsets": 2208,
      "90": 2209,
      "Ġwhe": 2210,
      "oun": 2211,
      "Ġsubtract": 2212,
      "Ġwindow": 2213,
      "pmatrix": 2214,
      "}$": 2215,
      "Ġallowed": 2216,
      "Ġimport": 2217,
      "Ġwins": 2218,
      "forward": 2219,
      ".,": 2220,
      "axis": 2221,
      "Ġnecessarily": 2222,
      "Ġwhite": 2223,
      "imeter": 2224,
      "Ġcycles": 2225,
      "umber": 2226,
      "Ġreact": 2227,
      "Ġstraightforward": 2228,
      "Ġloc": 2229,
      "fer": 2230,
      "Ġdefinition": 2231,
      "Ġmidpoint": 2232,
      ",-": 2233,
      "Ġprogram": 2234,
      "ounds": 2235,
      "pper": 2236,
      "Ġfraction": 2237,
      "bc": 2238,
      ")]": 2239,
      "ars": 2240,
      "ging": 2241,
      "Ġconve": 2242,
      "points": 2243,
      "igur": 2244,
      "nprint": 2245,
      "Ġgame": 2246,
      "ĠÏĢ": 2247,
      "case": 2248,
      "Ġcross": 2249,
      "Ġ28": 2250,
      "Ġvertical": 2251,
      "ser": 2252,
      "Ġrespectively": 2253,
      "cks": 2254,
      "Ġcounts": 2255,
      "ets": 2256,
      "ral": 2257,
      "Ġcm": 2258,
      "Ġfriend": 2259,
      "Ġsearch": 2260,
      "45": 2261,
      "Ġavailable": 2262,
      "vert": 2263,
      "Ġbd": 2264,
      "led": 2265,
      "Ġminutes": 2266,
      "Ġstrings": 2267,
      "Ġconfigur": 2268,
      "Ġhold": 2269,
      "Ġceil": 2270,
      "pos": 2271,
      "Ġexpect": 2272,
      "ior": 2273,
      "nloo": 2274,
      "ape": 2275,
      "nsum": 2276,
      "Ġroom": 2277,
      "pes": 2278,
      "ĠÂ": 2279,
      "Ġstudents": 2280,
      "since": 2281,
      "Ġtarget": 2282,
      "Ġequals": 2283,
      "Ġ120": 2284,
      "Ġsl": 2285,
      "(\"": 2286,
      "Ġindices": 2287,
      "data": 2288,
      "Ġcr": 2289,
      "Ġpossib": 2290,
      "Ġcorresponds": 2291,
      "gether": 2292,
      "Ġmistake": 2293,
      "Ġinfinite": 2294,
      "imin": 2295,
      "ization": 2296,
      "tri": 2297,
      "Ġmade": 2298,
      "Ġsimply": 2299,
      "rightarrow": 2300,
      "Ġpartic": 2301,
      "Ġadding": 2302,
      "ten": 2303,
      "Ġslo": 2304,
      "Ġaccordingly": 2305,
      "ople": 2306,
      "Ġ...,": 2307,
      "Ġhorizontal": 2308,
      "anation": 2309,
      "Ġdifferences": 2310,
      "Ġincreases": 2311,
      "Ġgeometry": 2312,
      "ements": 2313,
      "el": 2314,
      "arent": 2315,
      "Ġlie": 2316,
      "Ġstdin": 2317,
      "Ġperson": 2318,
      "Ġhelps": 2319,
      "Ġthus": 2320,
      "calcul": 2321,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2322,
      "self": 2323,
      "ific": 2324,
      "Ġshare": 2325,
      "Ġstarts": 2326,
      "rad": 2327,
      "ning": 2328,
      "Ġmath": 2329,
      "Ġbottom": 2330,
      "Ġmap": 2331,
      "ts": 2332,
      "Ġgroups": 2333,
      "Ġconvex": 2334,
      "```\\": 2335,
      "Ġidea": 2336,
      "ress": 2337,
      "Ġtriple": 2338,
      "Ġvi": 2339,
      "`.\\": 2340,
      "neach": 2341,
      "gamma": 2342,
      "Ġpeople": 2343,
      "Ġupd": 2344,
      "Ġbal": 2345,
      "Ġque": 2346,
      "Ġmagn": 2347,
      "Ġmoving": 2348,
      "nex": 2349,
      "Ġcombinations": 2350,
      "Ġturn": 2351,
      "Ġwhether": 2352,
      "Ġsix": 2353,
      "Ġ\\\\,": 2354,
      "Ġsubt": 2355,
      "Ġinvolving": 2356,
      "Ġplug": 2357,
      "idth": 2358,
      "nthat": 2359,
      "ons": 2360,
      "Ġmay": 2361,
      "Ġmass": 2362,
      "wh": 2363,
      "Ġbreak": 2364,
      "Ġinst": 2365,
      "`,": 2366,
      "Ġgenerated": 2367,
      "Ġstatement": 2368,
      "ounter": 2369,
      "Ġstore": 2370,
      "nlooking": 2371,
      "Ġproperty": 2372,
      "ond": 2373,
      "29": 2374,
      "Ġworks": 2375,
      "Ġlevel": 2376,
      "ĠÏī": 2377,
      "Ġarrange": 2378,
      "Ġsphere": 2379,
      "Ġletter": 2380,
      "Ġ23": 2381,
      "Ġ99": 2382,
      "}\\\\)\\": 2383,
      "Ġexponents": 2384,
      "Ġpot": 2385,
      "ull": 2386,
      "Ġequilateral": 2387,
      "ming": 2388,
      "Ġlea": 2389,
      "Ġenough": 2390,
      "nl": 2391,
      "Ġeffect": 2392,
      "Ġtrick": 2393,
      "Ġchoices": 2394,
      "Ġcenters": 2395,
      "Ġblue": 2396,
      "Ġexplanation": 2397,
      "yz": 2398,
      "Ġcreate": 2399,
      "Ġour": 2400,
      "Ġvariables": 2401,
      "Ġflow": 2402,
      "ane": 2403,
